The parameters of the default type have no values.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId NoTypeParamsDefinedWarning { get; }
  Visual Basic
Public Shared ReadOnly Property NoTypeParamsDefinedWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoTypeParamsDefinedWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace